kAMDSuccess = "Aucune erreur ne s’est produite.";
kAMDUndefinedError = "Une erreur inconnue est survenue.";
kAMDBadHeaderError = "Impossible de transférer le fichier.";
kAMDNoResourcesError = "Une ressource n’a pas pu être allouée.";
kAMDReadError = "Lecture impossible depuis l’appareil.";
kAMDWriteError = "Écriture impossible sur l’appareil.";
kAMDUnknownPacketError = "Le paquet est inconnu.";
kAMDInvalidArgumentError = "L’argument n’est pas valide.";
kAMDNotFoundError = "Le fichier est introuvable.";
kAMDIsDirectoryError = "Le chemin est un répertoire.";
kAMDPermissionError = "Vous n’êtes pas autorisé.";
kAMDNotConnectedError = "Non connecté à l’appareil.";
kAMDTimeOutError = "Le délai de l’opération est dépassé.";
kAMDOverrunError = "Un dépassement de la capacité de la mémoire tampon est survenu.";
kAMDEOFError = "Fin du fichier.";
kAMDUnsupportedError = "Cette opération n’est pas gérée.";
kAMDFileExistsError = "Le fichier existe déjà.";
kAMDBusyError = "L’appareil est occupé.";
kAMDCryptoError = "Impossible d’établir une connexion sécurisée avec l’appareil.";
kAMDTooBigError = "Le message est trop volumineux.";
kAMDInvalidResponseError = "Réponse inattendue reçue de l’appareil.";
kAMDMissingKeyError = "La clé est manquante.";
kAMDMissingValueError = "La valeur est manquante.";
kAMDGetProhibitedError = "Impossible de récupérer la valeur depuis l’appareil verrouillé par code.";
kAMDSetProhibitedError = "Impossible de définir une valeur sur l’appareil.";
kAMDRemoveProhibitedError = "Impossible de supprimer cette valeur sur l’appareil.";
kAMDImmutableValueError = "Cette valeur ne peut être modifiée.";
kAMDPasswordProtectedError = "L’appareil est protégé par un code secret.";
kAMDMissingHostIDError = "L’appareil ne reconnaît pas cet hôte.";
kAMDInvalidHostIDError = "L’appareil ne reconnaît pas cet hôte.";
kAMDSessionActiveError = "La session est active.";
kAMDSessionInactiveError = "La session est inactive.";
kAMDMissingSessionIDError = "L’identifiant de session est manquant.";
kAMDInvalidSessionIDError = "L’identifiant de session n’est pas valide.";
kAMDMissingServiceError = "Le service est manquant.";
kAMDInvalidServiceError = "Le service n’est pas valide.";
kAMDServiceLimitError = "Trop d’instances de ce service sont déjà en cours d’exécution.";
kAMDCheckinSetupFailedError = "Impossible de démarrer le service sur l’appareil";
kAMDInvalidCheckinError = "Impossible de démarrer le service sur l’appareil";
kAMDCheckinTimeoutError = "Le service n’a pas démarré correctement sur l’appareil.";
kAMDCheckinConnectionFailedError = "Le service n’a pas démarré correctement sur l’appareil.";
kAMDCheckinReceiveFailedError = "Le service n’a pas démarré correctement sur l’appareil.";
kAMDCheckinResponseFailedError = "Le service n’a pas démarré correctement sur l’appareil.";
kAMDCheckinOutOfMemoryError = "Le service n’a pas démarré correctement sur l’appareil.";
kAMDCheckinSendFailedError = "Le service n’a pas démarré correctement sur l’appareil.";
kAMDMissingPairRecordError = "L’hôte n’est pas associé à cet appareil.";
kAMDInvalidPairRecordError = "L’hôte n’est plus associé à cet appareil.";
kAMDSavePairRecordFailedError = "Impossible d’enregistrer la fiche de jumelage.";
kAMDInvalidActivationRecordError = "Les données d’activation ne sont pas valides.";
kAMDMissingActivationRecordError = "Les données d’activation sont introuvables.";
kAMDServiceProhibitedError = "Impossible de démarrer le service sur l’appareil.";
kAMDEscrowLockedError = "L’appareil n’est pas disponible avant le premier déverrouillage après démarrage.";
kAMDProhibitedBySupervision = "Opération interdite sur les appareils supervisés.";
kAMDPairingProhibitedError = "Jumelage uniquement autorisé via USB.";
kAMDWrongDroidError = "L’appareil est en mode de récupération.";
kAMDSUVerificationError = "Impossible de vérifier le paquet de mise à jour logicielle.";
kAMDSUPatchError = "Impossible de corriger le fichier.";
kAMDSUFirmwareError = "Impossible de remplacer le programme interne.";
kAMDProvisioningProfileNotValid = "Le profil d’approvisionnement n’est pas valide.";
kAMDSendMessageError = "Impossible d’envoyer un message à l’appareil.";
kAMDReceiveMessageError = "Impossible de recevoir un message de l’appareil.";
kAMDMissingOptionsError = "Les options sont manquantes.";
kAMDMissingImageTypeError = "L’image est manquante.";
kAMDDigestFailedError = "Impossible de lire l’image disque.";
kAMDStartServiceError = "Impossible de démarrer le service.";
kAMDInvalidDiskImageError = "L’image disque n’est pas valide.";
kAMDMissingDigestError = "Le condensé (digest) est manquant.";
kAMDMuxError = "Une erreur est survenue avec le multiplexeur du périphérique USB.";
kAMDApplicationAlreadyInstalledError = "Une application système avec l’identifiant du paquet donné est déjà installée sur l’appareil et ne peut être remplacée.";
kAMDApplicationMoveFailedError = "Impossible de déplacer l’application vers son emplacement sur l’appareil.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Sandboxing impossible pour cette application.";
kAMDApplicationVerificationFailedError = "Il est impossible de vérifier l’application.";
kAMDArchiveDestructionFailedError = "Impossible de supprimer l’archive de l’application.";
kAMDBundleVerificationFailedError = "Impossible de vérifier le paquet de l’opérateur.";
kAMDCarrierBundleCopyFailedError = "Impossible d’installer le paquet de l’opérateur.";
kAMDCarrierBundleDirectoryCreationFailedError = "Impossible de créer le répertoire du paquet de l’opérateur.";
kAMDCarrierBundleMissingSupportedSIMsError = "Il n’y a aucune SIM gérée pour ce paquet de l’opérateur.";
kAMDCommCenterNotificationFailedError = "Impossible de détecter une notification de la bande de base.";
kAMDContainerCreationFailedError = "Impossible de créer un conteneur d’application.";
kAMDContainerP0wnFailedError = "Impossible de corriger les autorisations du conteneur de l’application.";
kAMDContainerRemovalFailedError = "Impossible de supprimer le conteneur de l’application.";
kAMDEmbeddedProfileInstallFailedError = "Impossible d’installer le profil d’approvisionnement intégré.";
kAMDErrorError = "Une erreur s’est produite.";
kAMDExecutableTwiddleFailedError = "Impossible de modifier les autorisations liées aux exécutables dans l’application.";
kAMDExistenceCheckFailedError = "Impossible de vérifier la présence de l’application.";
kAMDInstallMapUpdateFailedError = "Impossible de mettre à jour la liste des applications installées.";
kAMDManifestCaptureFailedError = "Impossible d’enregistrer le manifeste de l’application.";
kAMDMapGenerationFailedError = "Impossible de générer la liste des applications.";
kAMDMissingBundleExecutableError = "Le paquet de l’application ne contient pas d’exécutable.";
kAMDMissingBundleIdentifierError = "Le paquet de l’application ne contient pas d’identifiant valide.";
kAMDMissingBundlePathError = "Impossible de déterminer le chemin du paquet de l’application.";
kAMDMissingContainerError = "Le conteneur de l’application installée est introuvable.";
kAMDNotificationFailedError = "Impossible d’envoyer une notification.";
kAMDPackageExtractionFailedError = "Impossible d’ouvrir le paquet de l’application.";
kAMDPackageInspectionFailedError = "Impossible d’examiner le paquet de l’application.";
kAMDPackageMoveFailedError = "Impossible de déplacer le paquet de l’application vers l’emplacement temporaire.";
kAMDPathConversionFailedError = "Impossible de convertir le chemin.";
kAMDRestoreContainerFailedError = "Impossible de restaurer le conteneur de l’application.";
kAMDSeatbeltProfileRemovalFailedError = "Impossible de supprimer le profil Seatbelt de l’application.";
kAMDStageCreationFailedError = "Impossible de créer le répertoire temporaire.";
kAMDSymlinkFailedError = "Impossible de créer le lien symbolique.";
kAMDiTunesArtworkCaptureFailedError = "Impossible d’enregistrer les illustrations iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Impossible d’enregistrer les métadonnées d’iTunes.";
kAMDAlreadyArchivedError = "L’application est déjà archivée.";
kAMDUnknownCommandError = "L’appareil ne reconnaît pas cette commande.";
kAMDAPIInternalError = "Une erreur interne d’API s’est produite.";
kAMDMuxCreateListenerError = "Impossible de détecter des périphériques USB.";
kAMDMuxGetListenerError = "Impossible d’obtenir l’observateur USB.";
kAMDMuxConnectError = "Connexion à l’appareil impossible.";
kAMDDeviceTooNewError = "Cette application doit être mise à jour.";
kAMDDeviceRefNoGood = "Cet appareil n’est plus connecté.";
kAMDDeviceDisconnectedError = "Cet appareil n’est plus connecté.";
kAMDCannotTranslateError = "Impossible de traduire les message de l’appareil.";
kAMDMobileImageMounterMissingImageSignature = "Développement non pris en charge.";
kAMDMobileImageMounterResponseCreationFailed = "Développement non pris en charge.";
kAMDMobileImageMounterMissingImageType = "Développement non pris en charge.";
kAMDMobileImageMounterMissingImagePath = "Développement non pris en charge.";
kAMDMobileImageMounterImageMapLoadFailed = "Développement non pris en charge.";
kAMDMobileImageMounterAlreadyMounted = "Développement non pris en charge.";
kAMDMobileImageMounterImageMoveFailed = "Développement non pris en charge.";
kAMDMobileImageMounterMountPathMissing = "Développement non pris en charge.";
kAMDMobileImageMounterMountPathNotEmpty = "Développement non pris en charge.";
kAMDMobileImageMounterImageMountFailed = "Développement non pris en charge.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Développement non pris en charge.";
kAMDMobileImageMounterDigestFailed = "Développement non pris en charge.";
kAMDMobileImageMounterDigestCreationFailed = "Développement non pris en charge.";
kAMDMobileImageMounterImageVerificationFailed = "Développement non pris en charge.";
kAMDMobileImageMounterImageInfoCreationFailed = "Développement non pris en charge.";
kAMDMobileImageMounterImageMapStoreFailed = "Développement non pris en charge.";
kAMDDeviceOSVersionTooLow = "La version de l’OS de cet appareil est trop ancienne.";
kAMDNoWifiSyncSupportError = "L’appareil ne gère pas la synchronisation sans fil.";
kAMDDeviceFamilyNotSupported = "Cette application ne prend pas en charge ce type d’appareil.";
kAMDPackagePatchFailedError = "Impossible d’appliquer la mise à jou à l’application.";
kAMDIncorrectArchitectureError = "Cette application ne prend pas en charge le type de CPU de cet appareil.";
kAMDPluginCopyFailedError = "Impossible de copier le module VPN dans le conteneur d’app.";
kAMDBreadcrumbFailedError = "Impossible d’écrire le fil d’Ariane de l’installation.";
kAMDBreadcrumbUnlockError = "Impossible de mettre à jour le fil d’Ariane de l’installation.";
kAMDGeoJSONCaptureFailedError = "Impossible d’enregistrer les données GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Impossible d’enregistrer les illustrations Newsstand.";
kAMDMissingCommandError = "La demande ne contenait pas de commande.";
kAMDNotEntitledError = "L’application demandeuse n’est pas autorisée à effectuer cette demande.";
kAMDMissingPackagePathError = "Le chemin du paquet de la demande était manquant.";
kAMDMissingContainerPathError = "Le chemin du conteneur de la demande était manquant.";
kAMDMissingApplicationIdentifierError = "L’identificateur d’application de la demande était manquant.";
kAMDMissingAttributeValueError = "Une valeur nécessaire pour la demande était manquante.";
kAMDLookupFailedError = "Impossible de dresser la liste des applications installées.";
kAMDDictCreationFailedError = "Impossible d’extraire les capacités de la demande.";

/* kMISFileError */
"A file operation failed." = "Une opération sur un fichier a échoué.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Une ressource signée a été ajoutée, modifiée ou supprimée.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Aucun profil d’approvisionnement valide n’a été trouvé pour cet exécutable.";

/* kMISUnknownError */
"An unknown error has occurred." = "Une erreur inconnue est survenue.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Tentative de modification d’un profil d’approvisionnement fixé.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "L’application ne possède pas de signature valide.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "La signature de l’application est valide mais ne correspond pas à la table de hachage attendue.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "L’exécutable comporte une signature non valide.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "L’exécutable a été signé avec des autorisations non valides.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "L’identité utilisée pour signer l’exécutable n’est plus valide.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "La signature n’était pas valide.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Une erreur s’est produite lors de la communication avec votre appareil.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Ce profil d’approvisionnement ne peut être installé sur cet appareil.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Ce profil d’approvisionnement ne possède pas de signature valide (ou celle-ci est valide mais non fiable).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Ce profil d’approvisionnement a expiré.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Ce profil d’approvisionnement est malformé.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Ce profil d’approvisionnement n’est pas géré.";

/* kMISAllocationError */
"Unable to allocate memory." = "Impossible d’allouer de la mémoire.";

